a9650615/esp32-rlcd-standalone/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_HZ=1000
# The initial LVGL object tree is built synchronously from app_main so startup
# failures can stop before the carousel timer is armed. The ESP-IDF default
# 3584-byte main-task stack overflows while rendering the first full page.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_QRCODE=y
# Wi-Fi setup portal: open captive AP + a 2-field HTTP form, no long POST
# bodies expected, but LWIP's default socket count is tight once the DNS
# responder's UDP socket and the setup AP's client join the HTTP listener.
CONFIG_LWIP_MAX_SOCKETS=16

# Providers fetch over HTTPS. The bundled root store avoids pinning a cert per
# host, which would break every time an upstream rotates.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=n

# mbedTLS allocates from PSRAM instead of internal RAM.
#
# Four providers on independent timers will overlap sooner or later, and two
# concurrent TLS sessions with the full certificate bundle do not fit in the
# ~240 KiB of internal heap: the second one fails ssl_setup with
# MBEDTLS_ERR_SSL_ALLOC_FAILED (-0x7F00) and its page shows NO DATA until the
# retry, minutes later. Observed with weather landing between the two market
# fetches.
#
# This board has 8 MiB of PSRAM that nothing else is competing for, so the fix
# is to stop making TLS share the scarce pool rather than to serialise the
# providers and have them wait on each other. Handshake buffers are not
# DMA targets, so PSRAM's restrictions do not apply to them.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# A freshly written OTA image boots as PENDING_VERIFY and is rolled back by the
# bootloader unless the app confirms it. main's ota_guard_task confirms it only
# after watching the LVGL render loop actually advance.
#
# This must be in place BEFORE the first image is ever written to an OTA slot:
# turning it on afterwards leaves that first update with no way back. Note that
# adding it here does nothing to an already-generated sdkconfig - delete
# sdkconfig and rebuild, then confirm the value landed (see the
# sdkconfig.defaults trap in the board skill).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
